MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crc.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_crc.c
  * @brief   CRC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Cyclic Redundancy Check (CRC) peripheral:
  *           + Initialization and deinitialization functions
  *           + Configuration functions
  *           + I/O operation functions
  *           + Peripheral state and error functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/** @addtogroup CRC
  * @{
  */
/** @defgroup CRC_Introduction CRC Introduction
  * @{

  The CRC hardware abstraction layer provides a set of APIs to configure and control the CRC peripheral on
  STM32 microcontrollers.

  The CRC (Cyclic Redundancy Check) calculation unit is used to compute a CRC code from 8-, 16-, or 32-bit data
  words and a generator polynomial.

  Among other applications, CRC-based techniques are used to verify data transmission or storage integrity.
  Within the scope of functional safety standards, they offer a means of verifying flash memory integrity.

  The CRC calculation unit helps compute a software signature at runtime, to be compared with a
  reference signature generated at link time and stored at a given memory location.


  */
/**
  * @}
  */

/** @defgroup CRC_How_To_Use CRC How To Use
  * @{
# How to use the CRC HAL module driver

## Use the CRC HAL driver as follows:

- Declare a @ref hal_crc_handle_t handle structure, for example:
   @ref hal_crc_handle_t  hcrc;

- Initialize the CRC handle by calling the HAL_CRC_Init() API. This API performs these operations:
 - Associate the instance with the handle
 - Initialize the handle state to HAL_CRC_STATE_IDLE

- Enable the CRC peripheral clock:
  - Either at application level by calling the **HAL_RCC_CRC_EnableClock()** API
  - Or set the USE_HAL_CRC_CLK_ENABLE_MODEL define to HAL_CLK_ENABLE_PERIPH_ONLY within
    the stm32c5xx_hal_conf.h file. In this case, the CRC clock is enabled within the HAL_CRC_Init()
    API

- Keep the default configuration (default register values) or configure the CRC module with user values:
  - Declare a @ref hal_crc_config_t structure
  - Fill all parameters of the declared configuration structure
  - Call the HAL_CRC_SetConfig() function. This function: \n
    Update the CRC registers according to the user configuration provided by the input config structure

- To restore the CRC default configuration, use the HAL_CRC_ResetConfig() API: \n
   This function resets the CRC configuration to the default one by setting the following fields
    to their default values:
    - The polynomial coefficient is set to 0x04C11DB7U
    - The polynomial size is set to 32-bits
    - The CRC init value is set to 0xFFFFFFFFU
    - The input reversibility mode is set to none
    - The output reversibility mode is set to none

- For CRC I/O operations, one operation mode is available within this driver: polling mode I/O operation
  - Compute the CRC value of the input data buffer starting with the configured CRC initialization value
    using the HAL_CRC_Calculate() function
  - Compute the CRC value of the input data buffer starting with the previously computed CRC
    using the HAL_CRC_Accumulate() function

- Deinitialize the CRC peripheral by calling the HAL_CRC_DeInit() API. This API performs these operations:
 - Reset the CRC configuration to the default one by setting the following fields to their default values:
    - The polynomial coefficient is set to 0x04C11DB7U
    - The polynomial size is set to 32-bits
    - The CRC init value is set to 0xFFFFFFFFU
    - The input reversibility mode is set to none
    - The output reversibility mode is set to none
 - Reset the independent data value to the default one (0xFFFFFFFFU)
 - Reset the handle state to the HAL_CRC_STATE_RESET
  */
/**
  * @}
  */

/** @defgroup CRC_Configuration_Table CRC Configuration Table
  * @{
## Configuration inside the CRC driver

Config defines               | Description               | Default value              | Note
---------------------------- | ------------------------- | -------------------------- | -----------------------------
PRODUCT                      | from IDE                  | NA                         | Example: STM32C5XX
USE_ASSERT_DBG_PARAM         | from IDE                  | NA                         | Enable parameter asserts
USE_ASSERT_DBG_STATE         | from IDE                  | NA                         | Enable state asserts
USE_HAL_CHECK_PARAM          | from stm32c5xx_hal_conf.h | 0                          | Runtime parameter check
USE_HAL_CRC_MODULE           | from stm32c5xx_hal_conf.h | 1                          | Enable the HAL CRC module
USE_HAL_CRC_CLK_ENABLE_MODEL | from stm32c5xx_hal_conf.h | HAL_CLK_ENABLE_PERIPH_ONLY | Enable HAL_CRC_CLK
USE_HAL_CRC_USER_DATA        | from stm32c5xx_hal_conf.h | 0                          | Allow user data usage
  */
/**
  * @}
  */

#if defined(USE_HAL_CRC_MODULE) && (USE_HAL_CRC_MODULE == 1U)

/* Private constants ---------------------------------------------------------*/
/** @defgroup CRC_Private_Constants CRC Private Constants
  * @{
  */
#define CRC_POLYSIZE_16B (16U) /*!< 16-bit polynomial */
#define CRC_POLYSIZE_8B  (8U)  /*!< 8-bit polynomial  */
#define CRC_POLYSIZE_7B  (7U)  /*!< 7-bit polynomial  */
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup CRC_Private_Macros CRC Private Macros
  * @{
  */

