MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crc.c
/*! Macro to check the polynomial size */
#define IS_CRC_POL_SIZE(size)     (((size) == HAL_CRC_POLY_SIZE_32B) \
                                   || ((size) == HAL_CRC_POLY_SIZE_16B) \
                                   || ((size) == HAL_CRC_POLY_SIZE_8B) \
                                   || ((size) == HAL_CRC_POLY_SIZE_7B))

/*! Macro to check the input reverse mode */
#define IS_CRC_INPUTDATA_REVERSE_MODE(mode)     (((mode) == HAL_CRC_INDATA_REVERSE_NONE) \
                                                 || ((mode) == HAL_CRC_INDATA_REVERSE_BYTE) \
                                                 || ((mode) == HAL_CRC_INDATA_REVERSE_HALFWORD) \
                                                 || ((mode) == HAL_CRC_INDATA_REVERSE_WORD) \
                                                 || ((mode) == HAL_CRC_INDATA_REVERSE_HALFWORD_BYWORD) \
                                                 || ((mode) == HAL_CRC_INDATA_REVERSE_BYTE_BYWORD))

/*! Macro to check the output reverse mode */
#define IS_CRC_OUTPUTDATA_REVERSE_MODE(mode)    (((mode) == HAL_CRC_OUTDATA_REVERSE_NONE) \
                                                 || ((mode) == HAL_CRC_OUTDATA_REVERSE_BIT) \
                                                 || ((mode) == HAL_CRC_OUTDATA_REVERSE_HALFWORD_BYWORD) \
                                                 || ((mode) == HAL_CRC_OUTDATA_REVERSE_BYTE_BYWORD))

/*! Macro to get the handle instance */
#define CRC_GET_INSTANCE(handle) ((CRC_TypeDef *)((uint32_t)(handle)->instance))

/*! Macro to check the coherence between the input reverse mode and the user data size */
#define IS_CRC_DATA_SIZE_VALID(handle, size) ((size != 0U) && ((((CRC_GET_INSTANCE(handle)->CR) & CRC_CR_REV_IN) \
                                                                == CRC_CR_REV_IN_1) ? \
                                                               ((size % 2U) == 0U) : \
                                                               ((((CRC_GET_INSTANCE(handle)->CR) & CRC_CR_REV_IN) \
                                                                 == (CRC_CR_REV_IN_1 | CRC_CR_REV_IN_0)) \
                                                                || (((CRC_GET_INSTANCE(handle)->CR) & CRC_CR_RTYPE_IN) \
                                                                    == CRC_CR_RTYPE_IN)) ? ((size % 4U) == 0U) : 1))

/*! Macro to check the coherence between the output reverse mode and the polynomial size */
#define IS_CRC_OUTPUT_REVERSE_MODE_VALID(poly_size, mode) ((poly_size != 0U) ? \
                                                           ((mode == HAL_CRC_OUTDATA_REVERSE_NONE) \
                                                            || (mode == HAL_CRC_OUTDATA_REVERSE_BIT)) : 1)
/**
  * @}
  */

/** @defgroup CRC_Private_Functions CRC Private Functions
  * @{
  */
static uint32_t CRC_FeedData(hal_crc_handle_t *hcrc, const uint8_t *p_data, uint32_t size_byte);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
static hal_status_t CRC_CheckPolynomial(uint32_t poly_coefficient, hal_crc_polynomial_size_t poly_size);
#endif /* USE_HAL_CHECK_PARAM */

static void CRC_ResetConfig(hal_crc_handle_t *hcrc);
/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup CRC_Exported_Functions
  * @{
  */

/** @addtogroup CRC_Exported_Functions_Group1
  * @{
This subsection provides functions to initialize and deinitialize the CRC peripheral: \n

- The HAL_CRC_Init() API: Allows initializing the HAL CRC driver so it can be configured and used to calculate the CRC
  of a given user data buffer.
  This API is the first API to call when using the HAL CRC. It takes two parameters as input:
 - The HAL CRC handle         : A pointer to a @ref hal_crc_handle_t structure
 - The CRC peripheral instance: A value from the enumeration @ref hal_crc_t  \n \n

- The HAL_CRC_DeInit() API: Allows deinitializing the HAL CRC driver by resetting:
   - The global CRC configuration to the default one (default register values)
   - The independent data register to the default value
   - The handle global state to the **HAL_CRC_STATE_RESET** \n \n
  */

/**
  * @brief  Initialize the CRC according to the associated instance.
  * @param  hcrc              Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified
  *                           CRC HAL context
  * @param  instance          @ref hal_crc_t enumerated type variable to be set according to the physical instance \n
  * @note   The user can choose to activate the CRC clock within the HAL_CRC_Init() function by setting
  *         the <b> USE_HAL_CRC_CLK_ENABLE_MODEL </b> flag to **HAL_CLK_ENABLE_PERIPH_ONLY**
  *         in the configuration file **stm32c5xx_hal_conf.h**
  *         \n
  * @retval HAL_INVALID_PARAM Invalid parameter return when the CRC handle is NULL
  * @retval HAL_OK            The HAL CRC driver is initialized according to the given handle and instance \n
  */
hal_status_t HAL_CRC_Init(hal_crc_handle_t *hcrc, hal_crc_t instance)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(IS_CRC_ALL_INSTANCE((CRC_TypeDef *)(uint32_t)instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hcrc == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcrc->instance = instance;

#if defined(USE_HAL_CRC_USER_DATA) && (USE_HAL_CRC_USER_DATA == 1)
  hcrc->p_user_data = NULL;
#endif /* (USE_HAL_CRC_USER_DATA) */

#if defined(USE_HAL_CRC_CLK_ENABLE_MODEL) && (USE_HAL_CRC_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_CRC_EnableClock();
#endif /* USE_HAL_CRC_CLK_ENABLE_MODEL */

  hcrc->global_state = HAL_CRC_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the CRC peripheral.
  * @param  hcrc Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified CRC HAL
  *              context
  */
void HAL_CRC_DeInit(hal_crc_handle_t *hcrc)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(IS_CRC_ALL_INSTANCE(CRC_GET_INSTANCE(hcrc)));

  CRC_ResetConfig(hcrc);

  LL_CRC_WriteIDR(CRC_GET_INSTANCE(hcrc), 0x00000000U);

