MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crc.c
  hcrc->global_state = HAL_CRC_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup CRC_Exported_Functions_Group2
  * @{
This subsection provides a set of functions to configure the CRC peripheral:

There are two categories of HAL configuration APIs.

- Global configuration APIs:
  - HAL_CRC_SetConfig()          : Used to apply the user configuration @ref hal_crc_config_t structure to the CRC
                                   peripheral
  - HAL_CRC_GetConfig()          : Used to retrieve the CRC configuration and to fill it into @ref hal_crc_config_t
                                   structure
  - HAL_CRC_ResetConfig()        : Used to restore the default CRC configuration(default registers values)
  - HAL_CRC_SetConfigPolynomial(): Used to configure the polynomial coefficient, size and the CRC Init value \n \n

- Unitary configuration APIs: \n
  These APIs are intended to dynamically modify or retrieve a unitary item, meaning that a global configuration has
  already been applied \n
  Do not handle items that can alter other configuration parameters within unitary APIs

  - HAL_CRC_SetInputReverseMode() : Used to set the @ref hal_crc_input_data_reverse_mode_t CRC input reverse mode
  - HAL_CRC_GetInputReverseMode() : Used to retrieve the @ref hal_crc_input_data_reverse_mode_t CRC input reverse mode
  - HAL_CRC_SetOutputReverseMode(): Used to set the @ref hal_crc_output_data_reverse_mode_t CRC output reverse mode
  - HAL_CRC_GetOutputReverseMode(): Used to retrieve the @ref hal_crc_output_data_reverse_mode_t CRC output reverse mode
  - HAL_CRC_SetIndependentData()  : Used to store user data in the CRC independent register
  - HAL_CRC_GetIndependentData()  : Used to retrieve the stored user data from the CRC independent register


Each configuration API must first check the IDLE state (meaning HAL_CRC_Init() has been performed)
    \n
  */

/**
  * @brief  Configure the CRC according to the user parameters.
  * @param  hcrc               Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified
  *                            CRC HAL context
  * @param  p_config           Pointer to a @ref hal_crc_config_t structure that contains the CRC configuration
  * @warning The Polynomial size must be aligned to the configured output reverse mode (ex when output reverse mode is
  *          set to **HAL_CRC_OUTDATA_REVERSE_HALFWORD_BYWORD**, the provided Polynomial size must be a word)
  * @retval HAL_INVALID_PARAM  Invalid parameter return when:
  *                            - The configuration structure pointer is NULL
  *                            - Or the provided polynomial is invalid (Even polynomial or polynomial size and
                                 coefficient are incoherent)
  * @retval HAL_OK             CRC peripheral is correctly configured
  */
hal_status_t HAL_CRC_SetConfig(hal_crc_handle_t *hcrc, const hal_crc_config_t *p_config)
{
  CRC_TypeDef *p_crcx;

  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_PARAM(IS_CRC_POL_SIZE(p_config->polynomial_size));

  ASSERT_DBG_PARAM(IS_CRC_INPUTDATA_REVERSE_MODE(p_config->input_data_reverse_mode));

  ASSERT_DBG_PARAM(IS_CRC_OUTPUTDATA_REVERSE_MODE(p_config->output_data_reverse_mode));

  ASSERT_DBG_PARAM(IS_CRC_OUTPUT_REVERSE_MODE_VALID(p_config->polynomial_size, p_config->output_data_reverse_mode));

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_config == NULL)
      || (CRC_CheckPolynomial(p_config->polynomial_coefficient, p_config->polynomial_size) != HAL_OK))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_crcx = CRC_GET_INSTANCE(hcrc);

  LL_CRC_SetPolynomialCoef(p_crcx, p_config->polynomial_coefficient);

  LL_CRC_SetPolynomialSize(p_crcx, (uint32_t)p_config->polynomial_size);

  LL_CRC_SetInitialData(p_crcx, p_config->crc_init_value);

  LL_CRC_SetDataReverseMode(p_crcx, (uint32_t) p_config->input_data_reverse_mode,
                            (uint32_t) p_config->output_data_reverse_mode);
  return HAL_OK;
}

/**
  * @brief  Retrieve the CRC configuration.
  * @param  hcrc     Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified CRC HAL
  *                  context
  * @param  p_config Pointer to a @ref hal_crc_config_t retrieved structure configuration
  */
void HAL_CRC_GetConfig(const hal_crc_handle_t *hcrc, hal_crc_config_t *p_config)
{
  CRC_TypeDef *p_crcx;

  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

  p_crcx = CRC_GET_INSTANCE(hcrc);

  p_config->polynomial_size = (hal_crc_polynomial_size_t)LL_CRC_GetPolynomialSize(p_crcx);

  p_config->polynomial_coefficient = LL_CRC_GetPolynomialCoef(p_crcx);

  p_config->crc_init_value = LL_CRC_GetInitialData(p_crcx);

  p_config->input_data_reverse_mode = (hal_crc_input_data_reverse_mode_t)LL_CRC_GetInputDataReverseMode(p_crcx);

  p_config->output_data_reverse_mode = (hal_crc_output_data_reverse_mode_t)LL_CRC_GetOutputDataReverseMode(p_crcx);
}

/**
  * @brief  This function allows resetting a set of fields to their default values.
  *         - The polynomial coefficient is set to 0x04C11DB7U
  *         - The polynomial size is set to 32-bits
  *         - The CRC init value is set to 0xFFFFFFFFU
  *         - The input reversibility mode is set to none
  *         - The output reversibility mode is set to none
  * @param  hcrc Pointer to a @ref hal_crc_handle_t structure  that is the object maintaining the specified CRC HAL
  *              context
  */
void HAL_CRC_ResetConfig(hal_crc_handle_t *hcrc)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

  CRC_ResetConfig(hcrc);
}

/**
  * @brief  Configure the CRC polynomial (polynomial size, polynomial coefficient, CRC init value).
  * @param  hcrc              Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified
  *                           CRC HAL context
  * @param  poly_coefficient  A **uint32_t** CRC Polynomial coefficient that must be odd and coherent with the
  *                           **poly_size**
  * @param  poly_size         CRC Polynomial size with a **hal_crc_polynomial_size_t** type and a value within:
  *                           - HAL_CRC_POLY_SIZE_32B
  *                           - HAL_CRC_POLY_SIZE_16B
  *                           - HAL_CRC_POLY_SIZE_8B
  *                           - HAL_CRC_POLY_SIZE_7B
  * @param  crc_init_value    A **uint32_t** initial CRC value
  * @retval HAL_INVALID_PARAM Invalid parameter return when the provided polynomial is invalid
  *                           (Even polynomial or polynomial size and coefficient are incoherent
                               or polynomial size and output reverse mode are incoherent)
  * @retval HAL_OK            CRC polynomial is correctly configured
  */
hal_status_t HAL_CRC_SetConfigPolynomial(hal_crc_handle_t *hcrc, uint32_t poly_coefficient,
                                         hal_crc_polynomial_size_t poly_size, uint32_t crc_init_value)
{
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  uint32_t out_rev_mode;
#endif /* USE_HAL_CHECK_PARAM */

  CRC_TypeDef *p_crcx;

  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(IS_CRC_POL_SIZE(poly_size));

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  out_rev_mode = LL_CRC_GetOutputDataReverseMode(CRC_GET_INSTANCE(hcrc));

  if ((poly_size != HAL_CRC_POLY_SIZE_32B)
      && ((out_rev_mode == LL_CRC_OUTDATA_REVERSE_HALFWORD_BYWORD)
          || (out_rev_mode == LL_CRC_OUTDATA_REVERSE_BYTE_BYWORD)))
  {
    return HAL_INVALID_PARAM;
  }

