MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crc.c
  if (CRC_CheckPolynomial(poly_coefficient, poly_size) != HAL_OK)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_crcx = CRC_GET_INSTANCE(hcrc);

  LL_CRC_SetPolynomialCoef(p_crcx, poly_coefficient);

  LL_CRC_SetPolynomialSize(p_crcx, (uint32_t)poly_size);

  LL_CRC_SetInitialData(p_crcx, crc_init_value);

  return HAL_OK;
}

/**
  * @brief  Configure the CRC Input reversibility mode.
  * @param  hcrc               Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified
  *                            CRC HAL context
  * @param  input_reverse_mode CRC input reversibility mode with a **hal_crc_input_data_reverse_mode_t** type and a
                               value within: \n
  *                            - HAL_CRC_INDATA_REVERSE_NONE
  *                            - HAL_CRC_INDATA_REVERSE_BYTE
  *                            - HAL_CRC_INDATA_REVERSE_HALFWORD
  *                            - HAL_CRC_INDATA_REVERSE_WORD
  *                            - HAL_CRC_INDATA_REVERSE_HALFWORD_BYWORD
  *                            - HAL_CRC_INDATA_REVERSE_BYTE_BYWORD
  * @retval HAL_OK             CRC input reverse mode is correctly configured
  */
hal_status_t HAL_CRC_SetInputReverseMode(hal_crc_handle_t *hcrc, hal_crc_input_data_reverse_mode_t input_reverse_mode)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(IS_CRC_INPUTDATA_REVERSE_MODE(input_reverse_mode));

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

  LL_CRC_SetInputDataReverseMode(CRC_GET_INSTANCE(hcrc), (uint32_t)input_reverse_mode);

  return HAL_OK;
}

/**
  * @brief  Retrieve the CRC configured input reversibility mode.
  * @param  hcrc Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified CRC HAL
  *              context
  * @retval HAL_CRC_INDATA_REVERSE_NONE             The bit order of the input data is not affected
  * @retval HAL_CRC_INDATA_REVERSE_BYTE             The bit reversal is done by byte. Example: 0x1A2B3C4D becomes
  *                                                 0x58D43CB2
  * @retval HAL_CRC_INDATA_REVERSE_HALFWORD         The bit reversal is done by half word
  *                                                 Ex: 0x1A2B3C4D becomes 0xD458B23C
  * @retval HAL_CRC_INDATA_REVERSE_WORD             The bit-reversal is done on the full word
  *                                                 Ex: 0x1A2B3C4D becomes 0xB23CD458
  * @retval HAL_CRC_INDATA_REVERSE_HALFWORD_BYWORD  The bit reversal is done by half word by word
  *                                                 Ex: 0x1A2B3C4D becomes 0x3C4D1A2B
  * @retval HAL_CRC_INDATA_REVERSE_BYTE_BYWORD      The bit reversal is done by byte by word
  *                                                 Ex: 0x1A2B3C4D becomes 0x4D3C2B1A
  */
hal_crc_input_data_reverse_mode_t HAL_CRC_GetInputReverseMode(const hal_crc_handle_t *hcrc)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

  return ((hal_crc_input_data_reverse_mode_t)LL_CRC_GetInputDataReverseMode(CRC_GET_INSTANCE(hcrc)));
}

/**
  * @brief  Configure the CRC Output reversibility mode.
  * @param  hcrc                Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the
  *                             specified CRC HAL context
  * @param  output_reverse_mode CRC output reversibility mode with a **hal_crc_output_data_reverse_mode_t** type and a
                                value within: \n
  *                             - HAL_CRC_OUTDATA_REVERSE_NONE
  *                             - HAL_CRC_OUTDATA_REVERSE_BIT
  *                             - HAL_CRC_OUTDATA_REVERSE_HALFWORD_BYWORD
  *                             - HAL_CRC_OUTDATA_REVERSE_BYTE_BYWORD
  * @retval HAL_INVALID_PARAM Invalid parameter return when the provided output reverse mode is invalid
  *                           (output reverse mode and polynomial size are incoherent)
  * @retval HAL_OK              CRC output reverse mode is correctly configured
  */
hal_status_t HAL_CRC_SetOutputReverseMode(hal_crc_handle_t *hcrc,
                                          hal_crc_output_data_reverse_mode_t output_reverse_mode)
{
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  uint32_t poly_size;
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(IS_CRC_OUTPUTDATA_REVERSE_MODE(output_reverse_mode));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  poly_size = LL_CRC_GetPolynomialSize(CRC_GET_INSTANCE(hcrc));

  if (((output_reverse_mode == HAL_CRC_OUTDATA_REVERSE_HALFWORD_BYWORD)
       || (output_reverse_mode == HAL_CRC_OUTDATA_REVERSE_BYTE_BYWORD))
      && (poly_size != LL_CRC_POLY_SIZE_32B))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

  LL_CRC_SetOutputDataReverseMode(CRC_GET_INSTANCE(hcrc), (uint32_t)output_reverse_mode);

  return HAL_OK;
}

/**
  * @brief  Retrieve the CRC configured output reversibility mode.
  * @param  hcrc Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified CRC HAL
  *              context
  * @retval HAL_CRC_OUTDATA_REVERSE_NONE           The bit order of the output data is not affected
  * @retval HAL_CRC_OUTDATA_REVERSE_BIT            The bit-reversal of the output data is done by byte
  * @retval HAL_CRC_OUTDATA_REVERSE_HALFWORD_BYWORD The reversibility is done half word by word
  * @retval HAL_CRC_OUTDATA_REVERSE_BYTE_BYWORD     The reversibility is done byte by word
  */
hal_crc_output_data_reverse_mode_t HAL_CRC_GetOutputReverseMode(const hal_crc_handle_t *hcrc)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

  return ((hal_crc_output_data_reverse_mode_t)LL_CRC_GetOutputDataReverseMode(CRC_GET_INSTANCE(hcrc)));
}

/**
  * @brief  Store user data in the Independent Data register.
  * @param  hcrc             Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified
  *                          CRC HAL context
  * @param  independent_data A **uint32_t** user data to be stored in the Independent data register
  * @retval HAL_OK           User independent data is correctly configured
  */
hal_status_t HAL_CRC_SetIndependentData(hal_crc_handle_t *hcrc, uint32_t independent_data)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

  LL_CRC_WriteIDR(CRC_GET_INSTANCE(hcrc), independent_data);

  return HAL_OK;
}

/**
  * @brief  Return the data stored in the Independent Data register.
  * @param  hcrc Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified CRC HAL
  *              context
  * @retval A **uint32_t** retrieved user data from the Independent data register
  */
uint32_t HAL_CRC_GetIndependentData(const hal_crc_handle_t *hcrc)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

