MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crc.c
  return (LL_CRC_ReadIDR(CRC_GET_INSTANCE(hcrc)));
}
/**
  * @}
  */

/** @addtogroup CRC_Exported_Functions_Group3
  * @{
This subsection provides two CRC calculation functions:

- HAL_CRC_Calculate() API:
This function allows the user to calculate the CRC of an input data buffer starting with the configured CRC init value

- HAL_CRC_Accumulate() API:
This function allows the user to calculate the CRC of an input data buffer starting with the previously computed CRC as
the initialization value \n \n
  */

/**
  * @brief  Compute the 7, 8, 16, or 32-bit CRC value of a user data buffer starting with hcrc->Instance->INIT as
  *         initialization value.
  * @param   hcrc             Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified
  *                           CRC HAL context
  * @param   p_data           Pointer to **const void** data buffer provided by the user (buffer of bytes, halfwords or
                              words)
  * @param   size_byte        A **uint32_t** input data buffer length (number of bytes)
  * @param   p_crc_result     A **uint32_t** Calculated CRC with a size aligned with the used polynomial one
  * @warning The data size must be aligned to the configured input reverse mode (ex when input reverse mode is set to
  *          **HAL_CRC_INDATA_REVERSE_WORD**, the provided data size must be a multiple of words)
  * @retval  HAL_INVALID_PARAM Invalid param return when the provided data buffer pointer is null or when this buffer is
  *                            empty
  * @retval  HAL_BUSY          Another calculation process is ongoing
  * @retval  HAL_OK            The CRC is successfully calculated
  */
hal_status_t HAL_CRC_Calculate(hal_crc_handle_t *hcrc, const void *p_data, uint32_t size_byte, uint32_t *p_crc_result)
{
  const uint8_t *p_tmp_data = (const uint8_t *)p_data;

  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(p_data != NULL);

  ASSERT_DBG_PARAM(IS_CRC_DATA_SIZE_VALID(hcrc, size_byte));

  ASSERT_DBG_PARAM(p_crc_result != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U) || (p_crc_result == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hcrc, global_state, HAL_CRC_STATE_IDLE, HAL_CRC_STATE_ACTIVE);

  LL_CRC_ResetCRCCalculationUnit(CRC_GET_INSTANCE(hcrc));

  /* Feed the CRC peripheral with the user data and get the CRC result */
  *p_crc_result = CRC_FeedData(hcrc, p_tmp_data, size_byte);

  hcrc->global_state = HAL_CRC_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Compute the 7, 8, 16, or 32-bit CRC value of a user data buffer starting with the previously computed CRC as
  *         the initialization value.
  * @param   hcrc             Pointer to a @ref hal_crc_handle_t structure that is the object maintaining the specified
  *                           CRC HAL context
  * @param   p_data           Pointer to **const void** data buffer provided by the user (buffer of bytes, halfwords or
                              words)
  * @param   size_byte        A **uint32_t** input data buffer length (number of bytes)
  * @param   p_crc_result     A **uint32_t** Calculated CRC with a size aligned with the used polynomial one
  * @warning The data size must be aligned to the configured input reverse mode (ex when input reverse mode is set to
  *          **HAL_CRC_INDATA_REVERSE_WORD**, the provided data size must be a multiple of words)
  * @retval  HAL_INVALID_PARAM Invalid param return when the provided data buffer pointer is null or when this buffer is
  *                            empty
  * @retval  HAL_BUSY          Another calculation process is ongoing
  * @retval  HAL_OK            The CRC is successfully calculated
  * @note    The HAL_CRC_Accumulate() function must not be applied when the input reverse mode's granularity is higher
  *          than the number of bytes already calculated
  *          \n
  */
hal_status_t HAL_CRC_Accumulate(hal_crc_handle_t *hcrc, const void *p_data, uint32_t size_byte, uint32_t *p_crc_result)
{
  const uint8_t *p_tmp_data = (const uint8_t *)p_data;

  ASSERT_DBG_PARAM(hcrc != NULL);

  ASSERT_DBG_PARAM(p_data != NULL);

  ASSERT_DBG_PARAM(IS_CRC_DATA_SIZE_VALID(hcrc, size_byte));

  ASSERT_DBG_PARAM(p_crc_result != NULL);

  ASSERT_DBG_STATE(hcrc->global_state, HAL_CRC_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U) || (p_crc_result == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hcrc, global_state, HAL_CRC_STATE_IDLE, HAL_CRC_STATE_ACTIVE);

  /* Feed the CRC peripheral with the user data and get the CRC result */
  *p_crc_result = CRC_FeedData(hcrc, p_tmp_data, size_byte);

  hcrc->global_state = HAL_CRC_STATE_IDLE;

  return HAL_OK;
}

/**
  * @}
  */


/** @addtogroup CRC_Exported_Functions_Group4
  * @{
This subsection provides a HAL_CRC_GetState() function to retrieve the CRC peripheral global state
  */


/**
  * @brief  Retrieve the HAL CRC Global State.
  * @param  hcrc                 Pointer to a @ref hal_crc_handle_t structure  that is the object maintaining the
  *                              specified CRC HAL context
  * @retval HAL_CRC_STATE_RESET  CRC peripheral is de-initialized
  * @retval HAL_CRC_STATE_IDLE   CRC peripheral is initialized and configured
  * @retval HAL_CRC_STATE_ACTIVE CRC calculation is ongoing
  */
hal_crc_state_t HAL_CRC_GetState(const hal_crc_handle_t *hcrc)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  return hcrc->global_state;
}
/**
  * @}
  */

#if defined (USE_HAL_CRC_USER_DATA) && (USE_HAL_CRC_USER_DATA == 1)
/** @addtogroup CRC_Exported_Functions_Group5
  * @{
This subsection provides a set of functions to get and set user data:
  - HAL_CRC_SetUserData() : Used to store the application user data pointer into the handle
  - HAL_CRC_GetUserData() : Used to retrieve the application user data pointer from the handle
  */
/**
  * @brief  Store application user data pointer into the handle.
  * @param  hcrc        Pointer to a @ref hal_crc_handle_t structure
  * @param  p_user_data Pointer to the user data
  */
void HAL_CRC_SetUserData(hal_crc_handle_t *hcrc, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  hcrc->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the application user data pointer from the handle.
  * @param  hcrc Pointer to a @ref hal_crc_handle_t structure
  * @retval Pointer to the user data
  */
const void *HAL_CRC_GetUserData(const hal_crc_handle_t *hcrc)
{
  ASSERT_DBG_PARAM(hcrc != NULL);

  return (hcrc->p_user_data);
}
/**
  * @}
  */
#endif /* USE_HAL_CRC_USER_DATA == 1 */

/**
  * @}
  */

/** @addtogroup CRC_Private_Functions
  * @{
  */
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)

/**
  * @brief  Check the validity of the CRC polynomial.
  *         - The polynomial coefficient must be odd (1+X+X^2+..+X^n)
  *         - The polynomial size and coefficient must be coherent
  * @param  poly_coefficient  A **uint32_t** CRC Polynomial coefficient that must be odd and coherent with the
  *                           **poly_size**
  * @param  poly_size         CRC Polynomial size with a **hal_crc_polynomial_size_t** type and a value within:
  *                           - HAL_CRC_POLY_SIZE_32B
  *                           - HAL_CRC_POLY_SIZE_16B
  *                           - HAL_CRC_POLY_SIZE_8B
  *                           - HAL_CRC_POLY_SIZE_7B
  * @retval HAL_OK            CRC Polynomial has been correctly configured
  * @retval HAL_INVALID_PARAM Invalid parameter return when the polynomial is even or when its size and coefficient
  *                           are incoherent \n
  * @note   The even polynomials (X+X^2+..+X^n) are not supported by the CRC peripheral
  *         \n
  */
static hal_status_t CRC_CheckPolynomial(uint32_t poly_coefficient, hal_crc_polynomial_size_t poly_size)
{
  hal_status_t status = HAL_OK;
  uint32_t msb = 31U; /* Polynomial degree is 32 at most, so msb is initialized to max value */

  /* Ensure that the generating polynomial is odd */
  if ((poly_coefficient % 2U) == 0U)
  {
    status =   HAL_INVALID_PARAM;
  }
  else
  {
    /** Check polynomial degree vs polynomial size:
      * Polynomial size must be aligned with polynomial degree.
      * HAL_INVALID_PARAM is reported if polynomial degree is larger than that indicated by polynomial size.
      * Look for the MSB position: msb contains the degree of the second-largest polynomial member.
      * E.g., for X^7 + X^6 + X^5 + X^2 + 1, msb = 6
      */
    while ((poly_coefficient & ((uint32_t)(0x1U) << (msb & 0x1FU))) == 0U)
    {
      msb--;
    }

    switch (poly_size)
    {
      case HAL_CRC_POLY_SIZE_7B:
        if (msb >= CRC_POLYSIZE_7B)
        {
          status =   HAL_INVALID_PARAM;
        }
        break;
      case HAL_CRC_POLY_SIZE_8B:
        if (msb >= CRC_POLYSIZE_8B)
        {
          status =   HAL_INVALID_PARAM;
        }
        break;
      case HAL_CRC_POLY_SIZE_16B:
        if (msb >= CRC_POLYSIZE_16B)
        {
          status =   HAL_INVALID_PARAM;
        }
        break;

