MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crc.c
      case HAL_CRC_POLY_SIZE_32B:
        /* No possible coherency issue between the polynomial coefficient and size */
        break;
      default:
        status =  HAL_INVALID_PARAM;
        break;
    }
  }

  return status;
}
#endif /* USE_HAL_CHECK_PARAM */

/**
  * @brief  Feed the CRC peripheral with the user buffer and return the calculated CRC value.
  *         Optimize the CRC data access according to the input data alignment and size.
  * @param  hcrc      Pointer to a @ref hal_crc_handle_t structure  that is the object maintaining the specified CRC
  *                   HAL context
  * @param  p_data    Pointer to the 8-bit input data buffer
  * @param  size_byte Input data buffer length (number of bytes)
  * @retval uint32_t  Calculated CRC with a size aligned with the used polynomial one
  */
static uint32_t CRC_FeedData(hal_crc_handle_t *hcrc, const uint8_t *p_data, uint32_t size_byte)
{
  const uint8_t *p_tmp_data = (const uint8_t *)p_data;
  uint32_t non_aligned_bytes = 0;
  uint32_t i;
  uint32_t last_bytes;
  CRC_TypeDef *p_crcx;

  p_crcx = CRC_GET_INSTANCE(hcrc);

  /* Alignment approach is not used to feed data register when the input reverse mode is other than none */
  if (((hal_crc_input_data_reverse_mode_t)LL_CRC_GetInputDataReverseMode(p_crcx)
       != HAL_CRC_INDATA_REVERSE_NONE) && (((uint32_t)p_tmp_data & 3U) != 0U))
  {
    for (i = 0U; i < (size_byte / 4U); i++)
    {
      LL_CRC_FeedData32(p_crcx, ((uint32_t)p_tmp_data[4U * i] << 24U) |
                        ((uint32_t)p_tmp_data[(4U * i) + 1U] << 16U) |
                        ((uint32_t)p_tmp_data[(4U * i) + 2U] << 8U)  |
                        (uint32_t)p_tmp_data[(4U * i) + 3U]);
    }
    p_tmp_data += i * 4U;
  }
  else
  {
    /* Read non aligned 32 bits address: address can be multiple of 1 or 2 or 3 */
    /* First address alignment if needed */
    if (size_byte >= 4U)
    {
      if (((uint32_t)p_data & 1U) != 0U)
      {
        LL_CRC_FeedData8(p_crcx, *p_tmp_data);
        non_aligned_bytes = 1U;
        p_tmp_data++;
      }

      /* Second address alignment if needed */
      if (((uint32_t)p_tmp_data & 3U) != 0U)
      {
        LL_CRC_FeedData16(p_crcx, (uint16_t)__REV16(*(const uint16_t *)p_tmp_data));
        non_aligned_bytes += 2U;
        p_tmp_data += 2U;
      }

      /* Enter 32-bit input data to the CRC calculator */
      for (i = 0; i < ((size_byte - non_aligned_bytes) / 4U); i++)
      {
        LL_CRC_FeedData32(p_crcx, __REV(*(const uint32_t *)p_tmp_data));
        p_tmp_data += 4U;
      }
    }
  }

  /* Last bytes specific handling */
  last_bytes = (size_byte - non_aligned_bytes) & 3U;
  if (last_bytes != 0U)
  {
    if (last_bytes == 1U)
    {
      LL_CRC_FeedData8(p_crcx, *p_tmp_data);
    }
    else if (last_bytes == 2U)
    {
      LL_CRC_FeedData16(p_crcx, ((uint16_t)(*p_tmp_data) << 8U) | (uint16_t) * (p_tmp_data + 1));
    }
    else
    {
      LL_CRC_FeedData16(p_crcx, ((uint16_t)(*p_tmp_data) << 8U) | (uint16_t) * (p_tmp_data + 1));
      LL_CRC_FeedData8(p_crcx, *(p_tmp_data + 2));
    }
  }

  /* Return the CRC computed value */
  return (p_crcx->DR);
}

/**
  * @brief  This function allows resetting the CRC configuration fields to their default values.
  *         - The polynomial coefficient is set to 0x04C11DB7U
  *         - The polynomial size is set to 32-bits
  *         - The CRC init value is set to 0xFFFFFFFFU
  *         - The input reversibility mode is set to none
  *         - The output reversibility mode is set to none
  * @param  hcrc Pointer to a @ref hal_crc_handle_t structure  that is the object maintaining the specified CRC HAL
  *              context
  */
static void CRC_ResetConfig(hal_crc_handle_t *hcrc)
{
  CRC_TypeDef *p_crcx;

  p_crcx = CRC_GET_INSTANCE(hcrc);

  LL_CRC_SetPolynomialCoef(p_crcx, LL_CRC_DEFAULT_CRC32_POLY);

  LL_CRC_SetPolynomialSize(p_crcx, LL_CRC_POLY_SIZE_32B);

  LL_CRC_SetInitialData(p_crcx, LL_CRC_DEFAULT_CRC_INITVALUE);

  LL_CRC_SetDataReverseMode(p_crcx, LL_CRC_INDATA_REVERSE_NONE, LL_CRC_OUTDATA_REVERSE_NONE);
}

/**
  * @}
  */

#endif /* USE_HAL_CRC_MODULE */
/**
  * @}
  */

/**
  * @}
  */
